<?php
$profile = [
  'name'   => 'PORTFOLIO',
  'about'  => "สวัสดีค่ะ ฉันนางสาว นริศรา พรมสากัน เกิดวันที่ 22 มกราคม พ.ศ.2547 กำลังศึกษาอยู่ที่มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา วิทยาเขตลำปาง 
  คณะวิทยาศาสตร์และเทคโนโลยีการเกษตร สาขาเทคโนโลยีสารสนเทศ 
  สนใจด้านการพัฒนา website ชอบเรียนรู้สิ่งใหม่ ๆ และพร้อมพัฒนาทักษะอย่างต่อเนื่อง",
  'interests' => [
  ],
  'social' => [
  ],
];

$skills = [
  'Soft Skills' => ['การทำงานเป็นทีม', 'การสื่อสาร', 'การแก้ปัญหา'],
  'Languages'   => ['ภาษาไทย (Native)', 'ภาษาอังกฤษ (Basic)'],
  'Frontend' => ['HTML','CSS3','JavaScript','Bootstrap','Tailwind (พื้นฐาน)'],
  'Backend'  => ['PHP','MySQL'],
  'Tools'=> ['Git','Figma','VS Code','XAMPP'],
  
];

// $projects = [
//   [
//     'title'=>'RMUTL Grade Web',
//     'desc'=>'ระบบเว็บออกเกรด สำหรับงานวิชา ออกแบบ UI เน้นความชัดเจนและเข้าถึงง่าย',
//     'img'=>'assets/img/projects/p1.jpg',
//     'tags'=>['PHP','MySQL','Responsive'],
//     'link'=>'#'
//   ],
//   [
//     'title'=>'Portfolio One-Page',
//     'desc'=>'พอร์ตโฟลิโอหน้าเดียว โหลดไว มี Dark/Light Mode และเอฟเฟ็กต์ glass',
//     'img'=>'assets/img/projects/p2.jpg',
//     'tags'=>['HTML','CSS','JS'],
//     'link'=>'#'
//   ],
//   [
//     'title'=>'IoT Dashboard',
//     'desc'=>'แดชบอร์ดแสดงค่าจาก ESP32 แบบเรียลไทม์ (จำลอง) พร้อมกราฟ',
//     'img'=>'assets/img/projects/p3.jpg',
//     'tags'=>['JS','Chart','UI'],
//     'link'=>'#'
//   ],
// ];

$timeline = [
  [
    'when'=> '',
    'title'=>'มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา ลำปาง เทคโนโลยีสารสนเทศ (ปริญญาตรี) ',
    'detail'=>'ทักษะที่ได้รับ: การวิเคราะห์ระบบ การทำงานเป็นทีม พื้นฐานของระบบฐานข้อมูล (MySQL, SQL Server) การเขียนโปรแกรมใน Java, C, PHP, HTML, Python, 
     ความรู้ด้านเครือข่าย การตัดสินใจ และการเตรียมความพร้อมเพื่อเป็นมืออาชีพด้านไอทีที่เชี่ยวชาญ',
  ],
  [
    'when'=>'',
    'title'=>'วิทยาลัยการอาชีพลอง สาขาวิชาคอมพิวเตอร์ธุรกิจ(ปวส.)',
    'detail'=>'เรียนรู้การพัฒนาเว็บแอปฯ ฐานข้อมูล และการเขียนโปรแกรมเชิงวัตถุ ควบคู่กับการตลาดดิจิทัลและซอฟต์แวร์ธุรกิจ พร้อมฝึกประสบการณ์วิชาชีพ',
  ],
];

$contacts = [
  ['label'=>'facebook','href'=>'Narissara Promsakan',         'text'=>'Narissara Promsakan'],
  ['label'=>'อีเมล', 'href'=>'bimnarissara220147@gmail.com', 'text'=>'bimnarissara220147@gmail.com'],
  ['label'=>'โทร',  'href'=>'tel:0983834840',       'text'=>'0983834840'],
  ['label'=>'ที่อยู่','href'=>'ลำปาง, ประเทศไทย',       'text'=>'ลำปาง, ประเทศไทย'],
  

];
